JavaJimbo/SDCardDemoPIC32/SD Card Demo PIC32/HardwareProfileBAD.h
        #define TRIS_WRITE_DETECT   TRISDbits.TRISD7    // Input
        #define WRITE_DETECT        PORTDbits.RD7
     
        // Chip Select Signal
        #define SD_CS               PORTBbits.RB3
        #define SD_CS_TRIS          TRISBbits.TRISB3
            
        // Card detect signal
        #define SD_CD               PORTBbits.RB4
        #define SD_CD_TRIS          TRISBbits.TRISB4
            
        // Write protect signal
        #define SD_WE               PORTDbits.RD7
        #define SD_WE_TRIS          TRISDbits.TRISD7
    
        // TRIS pins for the SCK/SDI/SDO lines
        #define SPICLOCK            TRISBbits.TRISB1
        #define SPIIN               TRISAbits.TRISA1
        #define SPIOUT              TRISAbits.TRISA5
    
        // Latch pins for SCK/SDI/SDO lines
        #define SPICLOCKLAT         LATBbits.LATB1
        #define SPIINLAT            LATAbits.LATA1
        #define SPIOUTLAT           LATAbits.LATA5
    
        // Port pins for SCK/SDI/SDO lines
        #define SPICLOCKPORT        PORTBbits.RB1
        #define SPIINPORT           PORTAbits.RA1
        #define SPIOUTPORT          PORTAbits.RA5
    
        // Registers for the SPI module you want to use
        #define SPICON1             SSP2CON1
        #define SPISTAT             SSP2STAT
        #define SPIBUF              SSP2BUF
        #define SPISTAT_RBF         SSP2STATbits.BF
        #define SPICON1bits         SSP2CON1bits
        #define SPISTATbits         SSP2STATbits
    
        #define SPI_INTERRUPT_FLAG  PIR3bits.SSP2IF 
        #define SPIENABLE           SSP2CON1bits.SSPEN
    
		#define SPI_INTERRUPT_FLAG_ASM  PIR1, 3
        
        // Will generate an error if the clock speed is too low to interface to the card
        #if (GetSystemClock() < 400000)
            #error System clock speed must exceed 400 kHz
        #endif

    #elif defined __PIC24F__

		#if defined (__PIC24FJ128GA010__)

	        // Description: SD-SPI Chip Select Output bit
	        #define SD_CS				LATBbits.LATB1
	        // Description: SD-SPI Chip Select TRIS bit
	        #define SD_CS_TRIS			TRISBbits.TRISB1
	        
	        // Description: SD-SPI Card Detect Input bit
	        #define SD_CD               PORTFbits.RF0
	        // Description: SD-SPI Card Detect TRIS bit
	        #define SD_CD_TRIS          TRISFbits.TRISF0
	        
	        // Description: SD-SPI Write Protect Check Input bit
	        #define SD_WE               PORTFbits.RF1
	        // Description: SD-SPI Write Protect Check TRIS bit
	        #define SD_WE_TRIS          TRISFbits.TRISF1
	        
	        // Registers for the SPI module you want to use

	        // Description: The main SPI control register
	        #define SPICON1             SPI1CON1
	        // Description: The SPI status register
	        #define SPISTAT             SPI1STAT
	        // Description: The SPI Buffer
	        #define SPIBUF              SPI1BUF
	        // Description: The receive buffer full bit in the SPI status register
	        #define SPISTAT_RBF         SPI1STATbits.SPIRBF
	        // Description: The bitwise define for the SPI control register (i.e. _____bits)
	        #define SPICON1bits         SPI1CON1bits
	        // Description: The bitwise define for the SPI status register (i.e. _____bits)
	        #define SPISTATbits         SPI1STATbits
	        // Description: The enable bit for the SPI module
	        #define SPIENABLE           SPISTATbits.SPIEN

	        // Tris pins for SCK/SDI/SDO lines

	        // Description: The TRIS bit for the SCK pin
	        #define SPICLOCK            TRISFbits.TRISF6
	        // Description: The TRIS bit for the SDI pin
	        #define SPIIN               TRISFbits.TRISF7
	        // Description: The TRIS bit for the SDO pin
	        #define SPIOUT              TRISFbits.TRISF8

		#elif defined (__PIC24FJ256GB110__)

	        // Description: SD-SPI Chip Select Output bit
	        #define SD_CS				LATBbits.LATB1
	        // Description: SD-SPI Chip Select TRIS bit
	        #define SD_CS_TRIS			TRISBbits.TRISB1
	        
	        // Description: SD-SPI Card Detect Input bit
	        #define SD_CD               PORTFbits.RF0
	        // Description: SD-SPI Card Detect TRIS bit
	        #define SD_CD_TRIS          TRISFbits.TRISF0
	        
	        // Description: SD-SPI Write Protect Check Input bit
	        #define SD_WE               PORTFbits.RF1
	        // Description: SD-SPI Write Protect Check TRIS bit
	        #define SD_WE_TRIS          TRISFbits.TRISF1
	        
	        // Registers for the SPI module you want to use

	        // Description: The main SPI control register
	        #define SPICON1             SPI1CON1
	        // Description: The SPI status register
	        #define SPISTAT             SPI1STAT
	        // Description: The SPI Buffer
	        #define SPIBUF              SPI1BUF
	        // Description: The receive buffer full bit in the SPI status register
	        #define SPISTAT_RBF         SPI1STATbits.SPIRBF
	        // Description: The bitwise define for the SPI control register (i.e. _____bits)
	        #define SPICON1bits         SPI1CON1bits
	        // Description: The bitwise define for the SPI status register (i.e. _____bits)
	        #define SPISTATbits         SPI1STATbits
	        // Description: The enable bit for the SPI module
	        #define SPIENABLE           SPISTATbits.SPIEN

	        // Tris pins for SCK/SDI/SDO lines

	        // Description: The TRIS bit for the SCK pin
	        #define SPICLOCK            TRISBbits.TRISB0
	        // Description: The TRIS bit for the SDI pin
	        #define SPIIN               TRISDbits.TRISD2
	        // Description: The TRIS bit for the SDO pin
	        #define SPIOUT              TRISFbits.TRISF8

		#elif defined(__PIC24FJ256DA210__)

			// Description: SD-SPI Chip Select Output bit
			#define SD_CS   PORTGbits.RG6

			// Description: SD-SPI Chip Select TRIS bit
			#define SD_CS_TRIS  TRISGbits.TRISG6

